{"qid": "3-1", "context1": "一张微微泛黄的旧照片中，小伙子一身白色西装，脖子上系着领带，头发梳得整齐，与身旁衣着朴素的小女孩形成反差。", "context2": "一张微微泛黄的旧照片中，小伙子一身白色西装，脖子下系着领带，头发梳得整齐，与身旁衣着朴素的小女孩形成反差。", "results": [{"judge": "true", "reason": "两段文本的形式差异在于“脖子上”和“脖子下”。两段文本中都出现了以下空间实体：“小伙子”、“脖子”和“领带”。尽管两段文本在描述“领带”系着的位置上有形式差异，但实际上，“脖子上系着领带”和“脖子下系着领带”描述“领带”的处所是相同的，都位于脖子表面和胸前。因此，这两段文本可以描述相同的空间场景。"}]}
{"qid": "3-2", "context1": "兰兰惊奇地站在潜水桥上，透过玻璃看见大大小小的鱼游来游去，各种各样的船只从桥顶上驶过来划过去。", "context2": "兰兰惊奇地站在潜水桥下，透过玻璃看见大大小小的鱼游来游去，各种各样的船只从桥顶上驶过来划过去。", "results": [{"judge": "false", "reason": "两段文本的形式差异在于“潜水桥上”和“潜水桥下”。两段文本中都出现了以下空间实体：“兰兰”和“潜水桥”。两段文本在描述“兰兰”站立的位置上存在形式差异，表明“兰兰站在潜水桥上”和“兰兰站在潜水桥下”描述“兰兰”的处所是不同的，前者位于桥的上方，后者位于桥的下方。因此，这两段文本不能描述相同的空间场景。"}]}
{"qid": "3-3", "context1": "火车上面空荡荡的，没什么人。", "context2": "火车里面空荡荡的，没什么人。", "results": [{"judge": "true", "reason": "两段文本的形式差异在于“火车上面”和“火车里面”。两段文本中都出现了以下空间实体：“火车”和“人”。尽管两段文本在描述“人”在火车中的位置上有形式差异，但实际上，“火车上面没什么人”和“火车里面没什么人”描述“人”的处所是相同的，都位于火车内部。因此，这两段文本可以描述相同的空间场景。"}]}
{"qid": "3-4", "context1": "绣梅坐在屋子里面，凝视着璀璨的星空。", "context2": "绣梅坐在屋子上面，凝视着璀璨的星空。", "results": [{"judge": "false", "reason": "两段文本的形式差异在于“屋子里面”和“屋子上面”。两段文本中都出现了以下空间实体：“绣梅”、“屋子”和“星空”。两段文本在描述“绣梅”坐的位置上存在形式差异，表明“屋子里面”和“屋子上面”描述“绣梅”的处所是不同的，前者位于屋子内部，后者位于屋顶。因此，这两段文本不能描述相同的空间场景。"}]}
{"qid": "3-5", "context1": "武官得到命令，走下场去，推上来一个铁笼，笼里有一头狮子。他打开斗兽场的铁门，放出狮子，让它走进场里，狮子在场里乱吼乱蹦。接着武官拉着斯巴达克出来，给他解开锁链，把他推进场里，然后把铁门锁了。狮子就跟斯巴达克打起来，打得非常激烈。观众都很紧张地看着。", "context2": "武官得到命令，走下场去，推上来一个铁笼，笼里有一头狮子。他打开斗兽场的铁门，放出狮子，让它走进场里，狮子在场里乱吼乱蹦。接着武官拉着斯巴达克进去，给他解开锁链，把他推进场里，然后把铁门锁了。狮子就跟斯巴达克打起来，打得非常激烈。观众都很紧张地看着。", "results": [{"judge": "true", "reason": "两段文本的形式差异在于“武官拉着斯巴达克出来”和“武官拉着斯巴达克进去”。两段文本中都出现了以下空间实体：“武官”、“斗兽场”和“斯巴达克”。尽管两段文本在描述“斯巴达克”进入斗兽场的位移上有形式差异，但实际上，“拉着斯巴达克出来”和“拉着斯巴达克进去”描述“斯巴达克”的位移方向是相同的，都是从场外到场内。因此，这两段文本可以描述相同的空间场景。"}]}
{"qid": "3-6", "context1": "我想象中，看见红星胡同、外交部街胡同、或是新开胡同，晚上一两点钟，飞快跑出来三两个十几岁的半大小子，一边回忆两个小王姑娘的大眼睛和想象衣服里面的样子，一边在树干上描画两个小王姑娘的名字，为了表示自己心无杂念的立场，名字下面又描画辱骂的字眼，在对第一个字尝试用刀子之后，感到既费力又不能彰显事功，于是罢手，上下左右打量自己的作品，朗读数遍，觉得形式整齐，韵律优美，进而想象两个小王看到这些字迹时的愤怒表情，心中欢喜不尽，回家睡觉。", "context2": "我想象中，看见红星胡同、外交部街胡同、或是新开胡同，晚上一两点钟，飞快跑进去三两个十几岁的半大小子，一边回忆两个小王姑娘的大眼睛和想象衣服里面的样子，一边在树干上描画两个小王姑娘的名字，为了表示自己心无杂念的立场，名字下面又描画辱骂的字眼，在对第一个字尝试用刀子之后，感到既费力又不能彰显事功，于是罢手，上下左右打量自己的作品，朗读数遍，觉得形式整齐，韵律优美，进而想象两个小王看到这些字迹时的愤怒表情，心中欢喜不尽，回家睡觉。", "results": [{"judge": "false", "reason": "两段文本的形式差异在于“飞快跑出来”和“飞快跑进去”。两段文本中都出现了以下空间实体：“红星胡同”、“外交部街胡同”、“新开胡同”和“半大小子”。两段文本在描述“半大小子”跑动的位移上存在形式差异，表明“飞快跑出来”和“飞快跑进去”描述“半大小子”的位移方向是不同的，前者是从胡同内到胡同外，后者是从胡同外到胡同内。因此，这两段文本不能描述相同的空间场景。"}]}
{"qid": "3-7", "context1": "乒乓球先是旋转了几下，接着从台面滚落到地上。", "context2": "乒乓球先是旋转了几下，接着从台面滚落到地下。", "results": [{"judge": "true", "reason": "两段文本的形式差异在于“地上”和“地下”。两段文本中都出现了以下空间实体：“乒乓球”和“地”。尽管两段文本在描述“乒乓球”滚落后抵达的位置上有形式差异，但实际上，“乒乓球滚到地上”和“乒乓球滚到地下”描述“乒乓球”的终点是相同的，都滚到了地面。因此，这两段文本可以描述相同的空间场景。"}]}
{"qid": "3-8", "context1": "我们考察一个地区的文明程度，不仅要依靠文献记载，还要注意实地考察地上的建筑物。", "context2": "我们考察一个地区的文明程度，不仅要依靠文献记载，还要注意实地考察地下的建筑物。", "results": [{"judge": "false", "reason": "两段文本的形式差异在于“地上”和“地下”。两段文本中都出现了以下空间实体：“地”和“建筑物”。两段文本在描述“建筑物”的所处位置上存在形式差异，表明“建筑物在地上”和“建筑物在地下”描述“建筑物”的处所是不同的，前者位于地面上方，后者位于地面下方。因此，这两段文本不能描述相同的空间场景。"}]}
{"qid": "3-9", "context1": "我们可以看到，这张照片上的人是2019年诺贝尔化学奖的三位得主，按照从左到右的顺序依次是：约翰·B·古迪纳夫、M·斯坦利·惠廷汉和吉野彰。", "context2": "我们可以看到，这张照片上的人是2019年诺贝尔化学奖的三位得主，按照从右到左的顺序依次是：吉野彰、M·斯坦利·惠廷汉和约翰·B·古迪纳夫。", "results": [{"judge": "true", "reason": "两段文本的形式差异在于“按照从左到右的顺序依次是：约翰·B·古迪纳夫、M·斯坦利·惠廷汉和吉野彰”和“按照从右到左的顺序依次是：吉野彰、M·斯坦利·惠廷汉和约翰·B·古迪纳夫”。两段文本中都出现了以下空间实体：“照片”、“约翰·B·古迪纳夫”、“M·斯坦利·惠廷汉”和“吉野彰”。尽管两段文本在描述“约翰·B·古迪纳夫”、“M·斯坦利·惠廷汉”和“吉野彰”的相互位置关系上有形式差异，但实际上，“从左到右的顺序依次是：约翰·B·古迪纳夫、M·斯坦利·惠廷汉和吉野彰”和“从右到左的顺序依次是：吉野彰、M·斯坦利·惠廷汉和约翰·B·古迪纳夫”描述“约翰·B·古迪纳夫”、“M·斯坦利·惠廷汉”和“吉野彰”的处所是相同的，都是约翰·B·古迪纳夫位于左侧，M·斯坦利·惠廷汉位于中间，吉野彰位于右侧。因此，这两段文本可以描述相同的空间场景。"}]}
{"qid": "3-10", "context1": "我们可以看到，这张照片上的人是2019年诺贝尔化学奖的三位得主，按照从左到右的顺序依次是：约翰·B·古迪纳夫、M·斯坦利·惠廷汉和吉野彰。", "context2": "我们可以看到，这张照片上的人是2019年诺贝尔化学奖的三位得主，按照从右到左的顺序依次是：约翰·B·古迪纳夫、M·斯坦利·惠廷汉和吉野彰。", "results": [{"judge": "false", "reason": "两段文本的形式差异在于“按照从左到右的顺序依次是：约翰·B·古迪纳夫、M·斯坦利·惠廷汉和吉野彰”和“按照从右到左的顺序依次是：约翰·B·古迪纳夫、M·斯坦利·惠廷汉和吉野彰”。两段文本中都出现了以下空间实体：“照片”、“约翰·B·古迪纳夫”、“M·斯坦利·惠廷汉”和“吉野彰”。两段文本在描述“约翰·B·古迪纳夫”、“M·斯坦利·惠廷汉”和“吉野彰”的相互位置关系上存在形式差异，表明“从左到右的顺序依次是：约翰·B·古迪纳夫、M·斯坦利·惠廷汉和吉野彰”和“从右到左的顺序依次是：约翰·B·古迪纳夫、M·斯坦利·惠廷汉和吉野彰”描述“约翰·B·古迪纳夫”、“M·斯坦利·惠廷汉”和“吉野彰”的处所是不同的，前者是约翰·B·古迪纳夫位于左侧，吉野彰位于右侧，后者是吉野彰位于左侧，约翰·B·古迪纳夫位于右侧。因此，这两段文本不能描述相同的空间场景。"}]}
